/**
 * session结构
 * 使用时同时传递userId
 */
export interface Session {
    /**
     * 登陆的用户id
     */
    userId: string;
    /**
     * 登陆的session
     * 同个账户的session会被下一次登陆顶替
     */
    session: string;
}

/**
 * 智能体类型
 */
export enum BotType {
    小小画家 = '7461135499336581120',
    知识点顺口溜 = '7461133675976409123',
    趣味科普站 = '7461259768041259044',
    历史说书人 = '7461251871794118692',
    英语对话伙伴 = '7461261068716359695',
    心事树洞 = '7461283049553444916',
    小小理财师 = '7461283306433658906',
    生活小妙招 = '7461283306433773594',
    健康小卫士 = '7461291072040206345',
    作业小助手 = '7461284004411916322',
    故事大王 = '7461283718603767834',
    友谊小顾问 = '7461285700701683766',
    每日暖心信 = '7461283718603882522',
}